app/controllers/students_controller.rb

  def index
    @student_array = Student.all
---
SELECT "students".* FROM "students"